# 

tap "homebrew/cask" # 'brew tap'
#tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git" # 'brew tap' with custom Git URL
#tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true # 'brew tap' with arguments

# 

cask_args appdir: "~/Applications", require_sha: true # set arguments for all 'brew install --cask' commands

# 

#brew "imagemagick" # 'brew install'
#brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed # 'brew install --with-rmtp', 'brew services restart' on version changes
#brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"] # 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)

#brew ruby # Ruby
#brew ruby-build # Ruby-Build  #brew ruby-install, args: ["HEAD"] # Ruby-Install
#brew rbenv # RBEnv  #brew chruby, args: ["HEAD"] # CHRuby

# 

#cask "google-chrome" # 'brew install --cask'
#cask "firefox", args: { appdir: "~/my-apps/Applications" } # 'brew install --cask --appdir=~/my-apps/Applications'
#cask "opera", greedy: true # always upgrade auto-updated or unversioned cask to latest version even if already installed
#cask "java" unless system "/usr/libexec/java_home --failfast" # 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails

cask "iTerm2" # iTerm2
cask "visual-studio-code" # Visual Studio Code

cask "vmware-fusion" # VMware Fusion
cask "parallels" # Parallels Desktop
cask "utm" # UTM

#cask "transmit" # Transmit
cask "firefox" # Firefox
cask "google-chrome" # Chrome

cask "dropbox" # Dropbox
cask "jumpcut" # Jumpcut
cask "rectangle" # Rectangle
cask "keycastr" # KeyCastr
cask "keepingyouawake" # KeepingYouAwake
cask "retroactive" # Retroactive
cask "onyx" # OnyX
cask "appzapper" # AppZapper

#cask "" # Zed
cask "hex-fiend" # Hex Fiend
cask "libreoffice" # LibreOffice  #cask "microsoft-office" # Office for Mac
cask "macdown" # MacDown

cask "affinity-photo" # Affinity Photo  #cask "adobe-creative-cloud" # Adobe Creative Cloud  #cask "gimp" # GIMP
cask "inkscape" # Inkscapes
cask "sketch" # Sketch

#cask "ableton-live-suite" # Ableton Live Suite

cask "handbrake" # HandBrake
cask "imageoptim" # ImageOptim

cask "vlc" # VLC Media Player
#cask "" # Gapplin

cask "protonmail-bridge" # ProtonMail Bridge
cask "whatsapp" # WhatsApp
cask "discord" # Discord
cask "tweetbot" # TweetBot

#cask "altdeploy" # AltDeploy  #cask "impactor" # Cydia Impactor
cask "android-file-transfer" # Android File Transfer
cask "trezor-suite" # Trezor Suite

cask "dolphin" # Dolphin
#cask "" # PCSX2
#cask "openemu" # OpenEmu

#cask "" # PokeFinder
cask "mactracker" # Mactracker

cask "transmission" # Transmission
cask "jdownloader" # JDownloader2

cask "spotify" # Spotify

# 

#mas "1Password", id: 443987910 # 'mas install'

mas "Server", id: 883878097 # macOS Server
mas "WorldWideWeb", id: 1621370168 # WorldWideWeb

#mas "Transmit", id: 1436522307 # Transmit  #mas "FileZilla Pro", id: 1298486723 # FileZilla Pro
#mas "Opera", id: 404764921 # Opera

mas "Magnet", id: 441258766 # Magnet
mas "Joystick Mapper", id: 528183797 # Joystick Mapper
mas "Amphetamine", id: 937984704 # Amphetamine
#mas "Gemini 2", id: 1090488118 # Gemini 2  #mas "Gemini", id: 463541543 # Gemini
mas "Apple Configurator", id: 1037126344 #mas "Apple Configurator", id:  # Apple Configurator

#mas "Microsoft Excel", id: 462058435 # Excel
#mas "Microsoft Word", id: 462054704 # Word
#mas "Microsoft PowerPoint", id: 462062816 # PowerPoint
mas "Microsoft OneNote", id: 784801555 # OneNote

#mas "Pixelmator", id: 407963104 # Pixelmator
#mas "", id:  # Sketch 3

mas "Aperture", id: 408981426 # Aperture #mas "Adobe Lightroom", id: 1451544217 # Photoshop Lightroom

mas "Gapplin", id: 768053424 # Gapplin

#mas "Microsoft Outlook", id: 985367838 # Outlook
#mas "", id:  # WhatsApp
mas "Twitter", id: 1482454543 #mas "Twitter", id: 409789998 #mas "Twitter", id:  # Twitter  #mas "TweetDeck", id: 485812721 # TweetDeck
#mas "Reeder", id: 439845554 # Reeder

mas "Silicon Info", id: 1542271266 # Silicon Info
mas "Coin Tick", id: 1141688067 # Coin Tick
mas "Mactracker", id: 430255202 # Mactracker

mas "Asphalt 8", id: 610391947 # Asphalt 8
mas "Asphalt 9", id: 1491129197 # Asphalt 9
mas "Oceanhorn", id: 1044375067 # Oceanhorn
mas "Rayman Origins", id: 696651502 # Rayman Origins
mas "SUPERHOT", id: 1109409676 # SuperHot
mas "Wasteland 2", id: 1105453220 # Wasteland 2

# 

#whalebrew "whalebrew/wget" # 'whalebrew install'


